BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Configuration.h
/*******************************************************************************
* \file       `$INSTANCE_NAME`_Configuration.h
* \version    `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* \brief
*   This file provides the customizer parameters definitions.
*
* \see CapSense v`$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION` Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CY_CAPSENSE_`$INSTANCE_NAME`_CONFIGURATION_H)
#define CY_CAPSENSE_`$INSTANCE_NAME`_CONFIGURATION_H

#include "syslib/cy_syslib.h"
#include "cyfitter.h"


/*******************************************************************************
* Customizer-generated defines
*******************************************************************************/
#define `$INSTANCE_NAME`_ENABLE                             (1u)
#define `$INSTANCE_NAME`_DISABLE                            (0u)

/*******************************************************************************
* Creator-global defines
*******************************************************************************/
#define `$INSTANCE_NAME`_2000_MV                            (2000u)

#ifdef CYDEV_VDDA_MV
    #define `$INSTANCE_NAME`_CYDEV_VDDA_MV                  (CYDEV_VDDA_MV)
#else
    #ifdef CYDEV_VDD_MV
        #define `$INSTANCE_NAME`_CYDEV_VDDA_MV              (CYDEV_VDD_MV)
    #endif
#endif

#define `$INSTANCE_NAME`_BAD_CONVERSIONS_NUM                (1u)
#define `$INSTANCE_NAME`_RESAMPLING_CYCLES_MAX_NUMBER       (1u)

/*******************************************************************************
* Enabled Scan Methods
*******************************************************************************/
#define `$INSTANCE_NAME`_CSD_EN                   (`$CsdEnable`u)
#define `$INSTANCE_NAME`_CSX_EN                   (`$CsxEnable`u)
#define `$INSTANCE_NAME`_CSD_CSX_EN               (`$INSTANCE_NAME`_CSD_EN & `$INSTANCE_NAME`_CSX_EN)

/*******************************************************************************
* Definitions for number of widgets and sensors
*******************************************************************************/
#define `$INSTANCE_NAME`_TOTAL_WIDGETS            (`$TotalWidgets`u)
#define `$INSTANCE_NAME`_TOTAL_CSD_WIDGETS        (`$TotalCsdWidgets`u)
#define `$INSTANCE_NAME`_TOTAL_CSD_SENSORS        (`$TotalCsdSensors`u)
#define `$INSTANCE_NAME`_TOTAL_CSX_WIDGETS        (`$TotalCsxWidgets`u)
#define `$INSTANCE_NAME`_TOTAL_CSX_NODES          (`$TotalCsxNodes`u)

/*******************************************************************************
* Total number of CSD sensors + CSX nodes
*******************************************************************************/
#define `$INSTANCE_NAME`_TOTAL_SENSORS            (`$INSTANCE_NAME`_TOTAL_CSD_SENSORS + \
                                                   `$INSTANCE_NAME`_TOTAL_CSX_NODES)

/*******************************************************************************
* Total number of scan slots (used only when dual-channel scan is enabled)
*******************************************************************************/
#define `$INSTANCE_NAME`_TOTAL_SCAN_SLOTS         (`$TotalScanSlots`u)

/*******************************************************************************
* Defines widget IDs
*******************************************************************************/
`$WidgetAlias`
/*******************************************************************************
* Defines sensor IDs
*******************************************************************************/
`$SensorAlias`
`$SlotAlias`
`$AdcChannelAlias`
/*******************************************************************************
* Enabled widget types
*******************************************************************************/
#define `$INSTANCE_NAME`_BUTTON_WIDGET_EN         (`$ButtonWidgetEnable`u)
#define `$INSTANCE_NAME`_SLIDER_WIDGET_EN         (`$SliderWidgetEnable`u)
#define `$INSTANCE_NAME`_MATRIX_WIDGET_EN         (`$MatrixWidgetEnable`u)
#define `$INSTANCE_NAME`_PROXIMITY_WIDGET_EN      (`$ProximityWidgetEnable`u)
#define `$INSTANCE_NAME`_TOUCHPAD_WIDGET_EN       (`$TouchpadWidgetEnable`u)

#define `$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN     (`$CsdMatrixWidgetEnable`u)
#define `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN   (`$CsdTouchpadWidgetEnable`u)

