BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Configuration.h
#define `$INSTANCE_NAME`_CSX_MATRIX_WIDGET_EN     (`$CsxMatrixWidgetEnable`u)
#define `$INSTANCE_NAME`_CSX_TOUCHPAD_WIDGET_EN   (`$CsxTouchpadWidgetEnable`u)

/*******************************************************************************
* Centroid APIs
*******************************************************************************/
#define `$INSTANCE_NAME`_CENTROID_EN              (`$CentroidEnable`u)
#define `$INSTANCE_NAME`_TOTAL_DIPLEXED_SLIDERS   (`$TotalDiplexedSliders`u)
#define `$INSTANCE_NAME`_TOTAL_LINEAR_SLIDERS     (`$TotalLinearSliders`u)
#define `$INSTANCE_NAME`_TOTAL_RADIAL_SLIDERS     (`$TotalRadialSliders`u)
#define `$INSTANCE_NAME`_TOTAL_TOUCHPADS          (`$TotalTouchpads`u)
#define `$INSTANCE_NAME`_MAX_CENTROID_LENGTH      (`$MaxCentroidLength`u)

/*******************************************************************************
* Enabled sensor types
*******************************************************************************/
#define `$INSTANCE_NAME`_REGULAR_SENSOR_EN        (`$RegularSensorEnable`u)
#define `$INSTANCE_NAME`_PROXIMITY_SENSOR_EN      (`$ProximitySensorEnable`u)

/*******************************************************************************
* Sensor ganging
*******************************************************************************/
#define `$INSTANCE_NAME`_GANGED_SNS_EN            (`$GangedSensorEnable`u)
#define `$INSTANCE_NAME`_CSD_GANGED_SNS_EN        (`$CsdGangedSensorEnable`u)
#define `$INSTANCE_NAME`_CSX_GANGED_SNS_EN        (`$CsxGangedSensorEnable`u)

/*******************************************************************************
* Max number of sensors used among all widgets
*******************************************************************************/
#define `$INSTANCE_NAME`_MAX_SENSORS_PER_WIDGET   (`$MaxSensorsPerWidget`u)

/*******************************************************************************
* Total number of all used electrodes (NOT unique)
*******************************************************************************/
#define `$INSTANCE_NAME`_TOTAL_ELECTRODES         (`$TotalElectrodes`u)
/* Obsolete */
#define `$INSTANCE_NAME`_TOTAL_SENSOR_IOS         `$INSTANCE_NAME`_TOTAL_ELECTRODES

/*******************************************************************************
* Total number of used physical IOs (unique)
*******************************************************************************/
#define `$INSTANCE_NAME`_TOTAL_IO_CNT             (`$TotalIoCount`u)

/*******************************************************************************
* Array length for widget status registers
*******************************************************************************/
#define `$INSTANCE_NAME`_WDGT_STATUS_WORDS        \
                        (((uint8)((`$INSTANCE_NAME`_TOTAL_WIDGETS - 1u) / 32u)) + 1u)


/*******************************************************************************
* Auto-tuning mode selection
*******************************************************************************/
#define `$INSTANCE_NAME`_CSD_SS_DIS         (0x00ul)
#define `$INSTANCE_NAME`_CSD_SS_HW_EN       (0x01ul)
#define `$INSTANCE_NAME`_CSD_SS_TH_EN       (0x02ul)
#define `$INSTANCE_NAME`_CSD_SS_HWTH_EN     (`$INSTANCE_NAME`_CSD_SS_HW_EN | \
                                             `$INSTANCE_NAME`_CSD_SS_TH_EN)

#define `$INSTANCE_NAME`_CSD_AUTOTUNE       `$CsdTuningMode`


/*******************************************************************************
* General settings
*******************************************************************************/

#define `$INSTANCE_NAME`_AUTO_RESET_METHOD_LEGACY (0u)
#define `$INSTANCE_NAME`_AUTO_RESET_METHOD_SAMPLE (1u)

#define `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN       (`$MultiFreqScanEnable`u)
#define `$INSTANCE_NAME`_SENSOR_AUTO_RESET_EN     (`$SensorAutoResetEnable`u)
#define `$INSTANCE_NAME`_SENSOR_AUTO_RESET_METHOD (`$SensorAutoResetMethod`u)
#define `$INSTANCE_NAME`_NUM_CENTROIDS            (`$NumCentroids`u)
#define `$INSTANCE_NAME`_4PTS_LOCAL_MAX_EN        (`$Centroid4PtsEnable`u)
#define `$INSTANCE_NAME`_OFF_DEBOUNCE_EN          (`$OffDebounceEnable`u)
#define `$INSTANCE_NAME`_CUSTOM_DS_RAM_SIZE       (`$CustomDataStructSize`u)

/* Defines power status of HW IP block after scanning */
#define `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN  (`$BlockOffAfterScanEnable`u)

/* Defines number of scan frequencies */
#if (`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
    #define `$INSTANCE_NAME`_NUM_SCAN_FREQS       (3u)
#else
    #define `$INSTANCE_NAME`_NUM_SCAN_FREQS       (1u)
#endif /* #if (`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

/* Data size for thresholds / low baseline reset */
#define `$INSTANCE_NAME`_SIZE_8BITS               (8u)
#define `$INSTANCE_NAME`_SIZE_16BITS              (16u)

#define `$INSTANCE_NAME`_THRESHOLD_SIZE           `$ThresholdSize`
typedef `$ThresholdType` `$INSTANCE_NAME`_THRESHOLD_TYPE;

#if (`$INSTANCE_NAME`_AUTO_RESET_METHOD_LEGACY == `$INSTANCE_NAME`_SENSOR_AUTO_RESET_METHOD)
    #define `$INSTANCE_NAME`_LOW_BSLN_RST_SIZE        `$LowBaselineResetSize`
    typedef `$LowBaselineResetType` `$INSTANCE_NAME`_LOW_BSLN_RST_TYPE;
#else
    #define `$INSTANCE_NAME`_LOW_BSLN_RST_SIZE    (16u)
    typedef uint16 `$INSTANCE_NAME`_LOW_BSLN_RST_TYPE;
#endif /* #if (`$INSTANCE_NAME`_AUTO_RESET_METHOD_LEGACY == `$INSTANCE_NAME`_SENSOR_AUTO_RESET_METHOD) */

/* Coefficient to define touch threshold for proximity sensors */
#define `$INSTANCE_NAME`_PROX_TOUCH_COEFF         (`$TouchProxThresholdCoeff`u)

/*******************************************************************************
* General Filter Constants
*******************************************************************************/

/* Baseline algorithm options */
#define `$INSTANCE_NAME`_IIR_BASELINE                 (0u)
#define `$INSTANCE_NAME`_BUCKET_BASELINE              (1u)

#define `$INSTANCE_NAME`_BASELINE_TYPE                `$BaselineType`

/* IIR baseline filter algorithm for regular sensors*/
#define `$INSTANCE_NAME`_REGULAR_IIR_BL_TYPE          `$RegularIirFilterBaselineType`

/* IIR baseline coefficients for regular sensors */
#define `$INSTANCE_NAME`_REGULAR_IIR_BL_N             (`$RegularIirFilterBaselineN`u)
#define `$INSTANCE_NAME`_REGULAR_IIR_BL_SHIFT         (`$RegularIirFilterBaselineShift`u)

/* IIR baseline filter algorithm for proximity sensors*/
#define `$INSTANCE_NAME`_PROX_IIR_BL_TYPE             `$ProxIirFilterBaselineType`

