BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Configuration.h
/* IIR baseline coefficients for proximity sensors */
#define `$INSTANCE_NAME`_PROX_IIR_BL_N                (`$ProxIirFilterBaselineN`u)
#define `$INSTANCE_NAME`_PROX_IIR_BL_SHIFT            (`$ProxIirFilterBaselineShift`u)


/* IIR filter constants */
#define `$INSTANCE_NAME`_IIR_COEFFICIENT_K            (256u)

/* IIR filter type */
#define `$INSTANCE_NAME`_IIR_FILTER_STANDARD          (1u)
#define `$INSTANCE_NAME`_IIR_FILTER_PERFORMANCE       (2u)
#define `$INSTANCE_NAME`_IIR_FILTER_MEMORY            (3u)

/* Regular sensor raw-count filters */
#define `$INSTANCE_NAME`_REGULAR_RC_FILTER_EN         (`$RegularFilterEnable`u)
#define `$INSTANCE_NAME`_REGULAR_RC_IIR_FILTER_EN     (`$RegularIirFilterEnable`u)
#define `$INSTANCE_NAME`_REGULAR_RC_MEDIAN_FILTER_EN  (`$RegularMedianFilterEnable`u)
#define `$INSTANCE_NAME`_REGULAR_RC_AVERAGE_FILTER_EN (`$RegularAverageFilterEnable`u)
#define `$INSTANCE_NAME`_REGULAR_RC_CUSTOM_FILTER_EN  (`$RegularCustomFilterEnable`u)
#define `$INSTANCE_NAME`_REGULAR_RC_ALP_FILTER_EN     (`$RegularAlpFilterEnable`u)

/* Proximity sensor raw-count filters */
#define `$INSTANCE_NAME`_PROX_RC_FILTER_EN            (`$ProxFilterEnable`u)
#define `$INSTANCE_NAME`_PROX_RC_IIR_FILTER_EN        (`$ProxIirFilterEnable`u)
#define `$INSTANCE_NAME`_PROX_RC_MEDIAN_FILTER_EN     (`$ProxMedianFilterEnable`u)
#define `$INSTANCE_NAME`_PROX_RC_AVERAGE_FILTER_EN    (`$ProxAverageFilterEnable`u)
#define `$INSTANCE_NAME`_PROX_RC_CUSTOM_FILTER_EN     (`$ProxCustomFilterEnable`u)
#define `$INSTANCE_NAME`_PROX_RC_ALP_FILTER_EN        (`$ProxAlpFilterEnable`u)

#define `$INSTANCE_NAME`_ALP_FILTER_EN                (`$AlpFilterEnable`u)
#define `$INSTANCE_NAME`_REGULAR_RC_ALP_FILTER_COEFF  (`$RegularAlpFilterCoeff`u)
#define `$INSTANCE_NAME`_PROX_RC_ALP_FILTER_COEFF     (`$ProxAlpFilterCoeff`u)

/* IIR raw-count filter algorithm for regular sensors */
#define `$INSTANCE_NAME`_REGULAR_IIR_RC_TYPE          (`$RegularIirFilterRawCountType`)

/* IIR raw-count filter coefficients for regular sensors */
#define `$INSTANCE_NAME`_REGULAR_IIR_RC_N             (`$RegularIirFilterRawCountN`u)
#define `$INSTANCE_NAME`_REGULAR_IIR_RC_SHIFT         (`$RegularIirFilterRawCountShift`u)

/* IIR raw-count filter algorithm for proximity sensors*/
#define `$INSTANCE_NAME`_PROX_IIR_RC_TYPE             (`$ProxIirFilterRawCountType`)

/* IIR raw-count filter coefficients for proximity sensors */
#define `$INSTANCE_NAME`_PROX_IIR_RC_N                (`$ProxIirFilterRawCountN`u)
#define `$INSTANCE_NAME`_PROX_IIR_RC_SHIFT            (`$ProxIirFilterRawCountShift`u)

/* Median filter constants */

/* Order of regular sensor median filter */
#define `$INSTANCE_NAME`_REGULAR_MEDIAN_LEN           (2u)

/* Order of proximity sensor median filter */
#define `$INSTANCE_NAME`_PROX_MEDIAN_LEN              (2u)

/* Average filter constants*/
#define `$INSTANCE_NAME`_AVERAGE_FILTER_LEN_2         (1u)
#define `$INSTANCE_NAME`_AVERAGE_FILTER_LEN_4         (3u)

/* Order of regular sensor average filter */
#define `$INSTANCE_NAME`_REGULAR_AVERAGE_LEN          (`$RegularAverageFilterLength`)

/* Order of proximity sensor average filter */
#define `$INSTANCE_NAME`_PROX_AVERAGE_LEN             (`$ProxAverageFilterLength`)

/* Widget baseline coefficient enable */
#define `$INSTANCE_NAME`_WD_BSLN_COEFF_EN             (`$WidgetBaselineCoeffEnable`u)

/* Centroid position filters */
#define `$INSTANCE_NAME`_POS_IIR_FILTER_EN            (`$PosIirFilterEnable`u)
#define `$INSTANCE_NAME`_POS_MEDIAN_FILTER_EN         (`$PosMedianFilterEnable`u)
#define `$INSTANCE_NAME`_POS_AVERAGE_FILTER_EN        (`$PosAverageFilterEnable`u)
#define `$INSTANCE_NAME`_POS_JITTER_FILTER_EN         (`$PosJitterFilterEnable`u)
#define `$INSTANCE_NAME`_CSX_TOUCHPAD_POS_MEDIAN_FILTER_EN (`$CsxTouchpadPosMedianFilterEnable`u)

#define `$INSTANCE_NAME`_POS_IIR_COEFF                (`$PosIirFilterCoeff`u)
#define `$INSTANCE_NAME`_CSX_TOUCHPAD_UNDEFINED       (40u)


/* IDAC options */

/* CSDv1 IDAC gain */
#define `$INSTANCE_NAME`_IDAC_GAIN_4X                 (4u)
#define `$INSTANCE_NAME`_IDAC_GAIN_8X                 (8u)

/* CSDv2 IDAC gain */
#define `$INSTANCE_NAME`_IDAC_GAIN_LOW                (0uL)
#define `$INSTANCE_NAME`_IDAC_GAIN_MEDIUM             (1uL)
#define `$INSTANCE_NAME`_IDAC_GAIN_HIGH               (2uL)

#define `$INSTANCE_NAME`_IDAC_SOURCING                (0u)
#define `$INSTANCE_NAME`_IDAC_SINKING                 (1u)

/* Shield tank capacitor precharge source */
#define `$INSTANCE_NAME`_CSH_PRECHARGE_VREF           (0u)
#define `$INSTANCE_NAME`_CSH_PRECHARGE_IO_BUF         (1u)

/* Shield electrode delay */
#define `$INSTANCE_NAME`_NO_DELAY                     (0u)
/* CSDv1 */
#define `$INSTANCE_NAME`_SH_DELAY_50NS                (1u)
#define `$INSTANCE_NAME`_SH_DELAY_100NS               (2u)
/* CSDv2 */
#define `$INSTANCE_NAME`_SH_DELAY_5NS                 (1u)
#define `$INSTANCE_NAME`_SH_DELAY_10NS                (2u)
#define `$INSTANCE_NAME`_SH_DELAY_20NS                (3u)

/* Inactive sensor connection options */
#define `$INSTANCE_NAME`_SNS_CONNECTION_GROUND        (1u)
#define `$INSTANCE_NAME`_SNS_CONNECTION_HIGHZ         (2u)
#define `$INSTANCE_NAME`_SNS_CONNECTION_SHIELD        (3u)

/* Sense clock selection options */
#define `$INSTANCE_NAME`_CLK_SOURCE_DIRECT            (0x00000000Lu)

#define `$INSTANCE_NAME`_CLK_SOURCE_SSC1              (0x01u)
#define `$INSTANCE_NAME`_CLK_SOURCE_SSC2              (0x02u)
#define `$INSTANCE_NAME`_CLK_SOURCE_SSC3              (0x03u)
#define `$INSTANCE_NAME`_CLK_SOURCE_SSC4              (0x04u)

/* CSDv1 and CSDv2 */
#define `$INSTANCE_NAME`_CLK_SOURCE_PRS8              (0x05u)
#define `$INSTANCE_NAME`_CLK_SOURCE_PRS12             (0x06u)
#define `$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO           (0xFFu)

/* Defines scan resolutions */
#define `$INSTANCE_NAME`_RES6BIT                      (6u)
#define `$INSTANCE_NAME`_RES7BIT                      (7u)
#define `$INSTANCE_NAME`_RES8BIT                      (8u)
#define `$INSTANCE_NAME`_RES9BIT                      (9u)
#define `$INSTANCE_NAME`_RES10BIT                     (10u)
#define `$INSTANCE_NAME`_RES11BIT                     (11u)
#define `$INSTANCE_NAME`_RES12BIT                     (12u)
#define `$INSTANCE_NAME`_RES13BIT                     (13u)
#define `$INSTANCE_NAME`_RES14BIT                     (14u)
#define `$INSTANCE_NAME`_RES15BIT                     (15u)
#define `$INSTANCE_NAME`_RES16BIT                     (16u)

/* CSDv2: Initialization switch resistance */
#define `$INSTANCE_NAME`_INIT_SW_RES_LOW              (0x00000000Lu)
#define `$INSTANCE_NAME`_INIT_SW_RES_MEDIUM           (0x00000001Lu)
#define `$INSTANCE_NAME`_INIT_SW_RES_HIGH             (0x00000002Lu)

/* CSDv2: Initialization switch resistance */
#define `$INSTANCE_NAME`_SCAN_SW_RES_LOW              (0x00000000Lu)
#define `$INSTANCE_NAME`_SCAN_SW_RES_MEDIUM           (0x00000001Lu)
#define `$INSTANCE_NAME`_SCAN_SW_RES_HIGH             (0x00000002Lu)

/* CSDv2: CSD shield switch resistance */
#define `$INSTANCE_NAME`_SHIELD_SW_RES_LOW            (0x00000000Lu)
#define `$INSTANCE_NAME`_SHIELD_SW_RES_MEDIUM         (0x00000001Lu)
#define `$INSTANCE_NAME`_SHIELD_SW_RES_HIGH           (0x00000002Lu)
#define `$INSTANCE_NAME`_SHIELD_SW_RES_LOW_EMI        (0x00000003Lu)

/* CSDv2: CSD shield switch resistance */
#define `$INSTANCE_NAME`_INIT_SHIELD_SW_RES_LOW       (0x00000000Lu)
#define `$INSTANCE_NAME`_INIT_SHIELD_SW_RES_MEDIUM    (0x00000001Lu)
#define `$INSTANCE_NAME`_INIT_SHIELD_SW_RES_HIGH      (0x00000002Lu)
#define `$INSTANCE_NAME`_INIT_SHIELD_SW_RES_LOW_EMI   (0x00000003Lu)

/* CSDv2: CSD shield switch resistance */
#define `$INSTANCE_NAME`_SCAN_SHIELD_SW_RES_LOW       (0x00000000Lu)
#define `$INSTANCE_NAME`_SCAN_SHIELD_SW_RES_MEDIUM    (0x00000001Lu)
#define `$INSTANCE_NAME`_SCAN_SHIELD_SW_RES_HIGH      (0x00000002Lu)
#define `$INSTANCE_NAME`_SCAN_SHIELD_SW_RES_LOW_EMI   (0x00000003Lu)

/* CSDv2: Vref source */
#define `$INSTANCE_NAME`_VREF_SRSS                    (0x00000000Lu)
#define `$INSTANCE_NAME`_VREF_PASS                    (0x00000001Lu)

/* CSDv2: Iref source */
#define `$INSTANCE_NAME`_IREF_SRSS                    (0x00000000Lu)
#define `$INSTANCE_NAME`_IREF_PASS                    (0x00000001Lu)

/* CSDv2: Sensing method */
#define `$INSTANCE_NAME`_SENSING_LEGACY               (0x00000000Lu)
#define `$INSTANCE_NAME`_SENSING_LOW_EMI              (0x00000001Lu)
#define `$INSTANCE_NAME`_SENSING_FULL_WAVE            (0x00000002Lu)


