BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Configuration.h
/*******************************************************************************
* CSD/CSX Common settings
*******************************************************************************/

#define `$INSTANCE_NAME`_CSD_VREF_SOURCE              (`$VrefSel`)
#define `$INSTANCE_NAME`_CSD_IREF_SOURCE              (`$IrefSel`)

#define `$INSTANCE_NAME`_LP_MODE_EN                   (`$LpModeEn`u)

#define `$INSTANCE_NAME`_CSDV2_ANALOG_WAKEUP_DELAY_US (`$CsdV2AnalogWakeupDelayUs`u)

/*******************************************************************************
* CSD Specific settings
*******************************************************************************/

/* CSD scan method settings */
#define `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN          (`$CsdIdacAutoCalibrateEnable`u)
`$CsdConfig`
#define `$INSTANCE_NAME`_CSD_SCANSPEED_DIVIDER        (`$CsdScanSpeedDivider`u)
#define `$INSTANCE_NAME`_CSD_COMMON_SNS_CLK_EN        (`$CsdCommonSenseClockEnable`u)
#define `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE           (`$CsdSenseClockSource`)
#define `$INSTANCE_NAME`_CSD_SNS_CLK_DIVIDER          (`$CsdSenseClockDivider`u)
#define `$INSTANCE_NAME`_CSD_INACTIVE_SNS_CONNECTION  (`$CsdInactiveSensorConnection`)
#define `$INSTANCE_NAME`_CSD_IDAC_COMP_EN             (`$CsdIdacCompEnable`u)
#define `$INSTANCE_NAME`_CSD_IDAC_CONFIG              (`$CsdIdacConfig`)
#define `$INSTANCE_NAME`_CSD_RAWCOUNT_CAL_LEVEL       (`$CsdRawCountCalibrationLevel`u)
#define `$INSTANCE_NAME`_CSD_DUALIDAC_LEVEL           (`$CsdDualIdacLevel`u)
#define `$INSTANCE_NAME`_CSD_PRESCAN_SETTLING_TIME    (`$CsdPrescanSettlingTime`u)
#define `$INSTANCE_NAME`_CSD_SNSCLK_R_CONST           (`$CsdSnsClockConstantR`u)
#define `$INSTANCE_NAME`_CSD_VREF_MV                  (`$CsdVrefMv`u)

/* CSD settings - CSDv2 */
#define `$INSTANCE_NAME`_CSD_ANALOG_STARTUP_DELAY_US  (`$CsdAnalogStartupDelayUs`u)
#define `$INSTANCE_NAME`_CSD_FINE_INIT_TIME           (`$CsdFineInitCycles`u)
#define `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN   (`$CsdDedicatedIdacCompEnable`u)
#define `$INSTANCE_NAME`_CSD_AUTO_ZERO_EN             (`$CsdAutoZeroEnable`u)
#define `$INSTANCE_NAME`_CSD_AUTO_ZERO_TIME           (`$CsdAutoZeroTime`Lu)
#define `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN          (`$CsdNoiseMetricEnable`u)
#define `$INSTANCE_NAME`_CSD_NOISE_METRIC_TH          (`$CsdNoiseMetricThreshold`Lu)
#define `$INSTANCE_NAME`_CSD_INIT_SWITCH_RES          (`$CsdInitSwitchRes`)
#define `$INSTANCE_NAME`_CSD_SENSING_METHOD           (`$CsdSensingMethod`)
#define `$INSTANCE_NAME`_CSD_SHIELD_SWITCH_RES        (`$CsdShieldSwitchRes`)
#define `$INSTANCE_NAME`_CSD_GAIN                     (`$CsdGain`Lu)

#define `$INSTANCE_NAME`_CSD_F1PM_SWITCH_RES_LE_INIT     (`$CsdF1PMSwitchResLowEmiInit`)
#define `$INSTANCE_NAME`_CSD_F1PM_SWITCH_RES_LE_SCAN     (`$CsdF1PMSwitchResLowEmiScan`)
#define `$INSTANCE_NAME`_CSD_F2PT_SWITCH_RES_LE_INIT     (`$CsdF2PTSwitchResLowEmiInit`)
#define `$INSTANCE_NAME`_CSD_F2PT_SWITCH_RES_LE_SCAN     (`$CsdF2PTSwitchResLowEmiScan`)
#define `$INSTANCE_NAME`_CSD_HCAG_SWITCH_RES_LE_INIT     (`$CsdHCAGSwitchResLowEmiInit`)
#define `$INSTANCE_NAME`_CSD_HCAG_SWITCH_RES_LE_SCAN     (`$CsdHCAGSwitchResLowEmiScan`)
#define `$INSTANCE_NAME`_CSD_HCAV_SWITCH_RES_LE_INIT     (`$CsdHCAVSwitchResLowEmiInit`)
#define `$INSTANCE_NAME`_CSD_HCAV_SWITCH_RES_LE_SCAN     (`$CsdHCAVSwitchResLowEmiScan`)
#define `$INSTANCE_NAME`_CSD_HCBG_SWITCH_RES_LE_INIT     (`$CsdHCBGSwitchResLowEmiInit`)
#define `$INSTANCE_NAME`_CSD_HCBG_SWITCH_RES_LE_SCAN     (`$CsdHCBGSwitchResLowEmiScan`)
#define `$INSTANCE_NAME`_CSD_HCBV_SWITCH_RES_LE_INIT     (`$CsdHCBVSwitchResLowEmiInit`)
#define `$INSTANCE_NAME`_CSD_HCBV_SWITCH_RES_LE_SCAN     (`$CsdHCBVSwitchResLowEmiScan`)

#define `$INSTANCE_NAME`_CSD_SENSE_WIDTH_LE              (`$CsdSenseWidthLowEmi`)

/*******************************************************************************
* CSX Specific settings
*******************************************************************************/

/* CSX scan method settings */
#define `$INSTANCE_NAME`_CSX_SCANSPEED_DIVIDER        (`$CsxScanSpeedDivider`u)
#define `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN         (`$CsxCommonTxClockEnable`u)
#define `$INSTANCE_NAME`_CSX_TX_CLK_SOURCE            (`$CsxTxClockSource`)
#define `$INSTANCE_NAME`_CSX_TX_CLK_DIVIDER           (`$CsxTxClockDivider`u)
#define `$INSTANCE_NAME`_CSX_MAX_FINGERS              (`$CsxMaxFingers`u)
#define `$INSTANCE_NAME`_CSX_MAX_LOCAL_PEAKS          (`$CsxMaxLocalPeaks`u)
#define `$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN          (`$CsxIdacAutoCalibrateEnable`u)
#define `$INSTANCE_NAME`_CSX_IDAC_BITS_USED           (`$CsxIdacBitsUsed`u)
#define `$INSTANCE_NAME`_CSX_RAWCOUNT_CAL_LEVEL       (`$CsxRawCountCalibrationLevel`u)
`$CsxConfig`
#define `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES (`$CsxSkipAndOversampleNodes`u)
#define `$INSTANCE_NAME`_CSX_MULTIPHASE_TX_EN         (`$CsxMultiphaseTxEnable`u)
#define `$INSTANCE_NAME`_CSX_MAX_TX_PHASE_LENGTH      (`$CsxMaxTxPhaseLength`u)

/* CSX settings - CSDv2 */
#define `$INSTANCE_NAME`_CSX_ANALOG_STARTUP_DELAY_US  (`$CsxAnalogStartupDelayUs`u)
#define `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN             (`$CsxAutoZeroEnable`u)
#define `$INSTANCE_NAME`_CSX_AUTO_ZERO_TIME           (`$CsxAutoZeroTime`u)
#define `$INSTANCE_NAME`_CSX_FINE_INIT_TIME           (`$CsxFineInitCycles`u)
#define `$INSTANCE_NAME`_CSX_NOISE_METRIC_EN          (`$CsxNoiseMetricEnable`u)
#define `$INSTANCE_NAME`_CSX_NOISE_METRIC_TH          (`$CsxNoiseMetricThreshold`u)
#define `$INSTANCE_NAME`_CSX_INIT_SWITCH_RES          (`$CsxInitSwitchRes`)
#define `$INSTANCE_NAME`_CSX_SCAN_SWITCH_RES          (`$CsxScanSwitchRes`)
#define `$INSTANCE_NAME`_CSX_INIT_SHIELD_SWITCH_RES   (`$CsxInitShieldSwitchRes`)
#define `$INSTANCE_NAME`_CSX_SCAN_SHIELD_SWITCH_RES   (`$CsxScanShieldSwitchRes`)

/* Gesture parameters */
#define `$INSTANCE_NAME`_GES_GLOBAL_EN                (`$GestureGlobalEnable`u)


/*******************************************************************************
* Global Parameter Definitions
*******************************************************************************/

/* RAM Global Parameters Definitions */
`$RamGlobalDefines`
`$WidgetDefines`
/* RAM Sensor Parameters Definitions */
`$SensorDefines`
`$GesturesDefines`
/*******************************************************************************
* ADC Specific Macros
*******************************************************************************/
#define `$INSTANCE_NAME`_ADC_RES8BIT                  (8u)
#define `$INSTANCE_NAME`_ADC_RES10BIT                 (10u)

#define `$INSTANCE_NAME`_ADC_FULLRANGE_MODE           (0u)
#define `$INSTANCE_NAME`_ADC_VREF_MODE                (1u)

#define `$INSTANCE_NAME`_ADC_EN                       (`$AdcEnable`u)
#define `$INSTANCE_NAME`_ADC_STANDALONE_EN            (`$AdcStandaloneEnable`u)
#define `$INSTANCE_NAME`_ADC_TOTAL_CHANNELS           (`$AdcTotalChannels`u)
#define `$INSTANCE_NAME`_ADC_RESOLUTION               (`$AdcResolution`)
#define `$INSTANCE_NAME`_ADC_AMUXB_INPUT_EN           (`$AdcAmuxbInputEnable`u)
#define `$INSTANCE_NAME`_ADC_SELECT_AMUXB_CH          (`$AdcSelectAmuxBusChannel`u)
#define `$INSTANCE_NAME`_ADC_AZ_EN                    (`$AdcAzEnable`Lu)
#define `$INSTANCE_NAME`_ADC_AZ_TIME                  (`$AdcAzTime`u)
#define `$INSTANCE_NAME`_ADC_VREF_MV                  (`$AdcVrefMv`u)
#define `$INSTANCE_NAME`_ADC_GAIN                     (`$AdcGain`Lu)
#define `$INSTANCE_NAME`_ADC_IDAC_DEFAULT             (`$AdcIdacDefault`u)
#define `$INSTANCE_NAME`_ADC_MODCLK_DIV_DEFAULT       (`$AdcModClkDivDefault`u)
#define `$INSTANCE_NAME`_ADC_MEASURE_MODE             (`$AdcMeasureMode`)
#define `$INSTANCE_NAME`_ADC_ANALOG_STARTUP_DELAY_US  (`$AdcAnalogStartupDelayUs`u)

/*******************************************************************************
* Built-In Self-Test Configuration
*******************************************************************************/
#define `$INSTANCE_NAME`_SELF_TEST_EN                   (`$SelfTestEnable`Lu)
#define `$INSTANCE_NAME`_TST_GLOBAL_CRC_EN              (`$SelfTestGlobalCrcEnable`Lu)
#define `$INSTANCE_NAME`_TST_WDGT_CRC_EN                (`$SelfTestWidgetCrcEnable`Lu)
#define `$INSTANCE_NAME`_TST_BSLN_DUPLICATION_EN        (`$SelfTestBaselineDuplicationEnable`Lu)
#define `$INSTANCE_NAME`_TST_BSLN_RAW_OUT_RANGE_EN      (`$SelfTestBaselineRawCountRangeEnable`Lu)
#define `$INSTANCE_NAME`_TST_SNS_SHORT_EN               (`$SelfTestSnsShortEnable`Lu)
#define `$INSTANCE_NAME`_TST_SNS2SNS_SHORT_EN           (`$SelfTestSns2SnsEnable`Lu)
#define `$INSTANCE_NAME`_TST_SNS_CAP_EN                 (`$SelfTestSnsCapEnable`Lu)
#define `$INSTANCE_NAME`_TST_SH_CAP_EN                  (`$SelfTestShCapEnable`Lu)
#define `$INSTANCE_NAME`_TST_EXTERNAL_CAP_EN            (`$SelfTestExtCapEnable`Lu)
#define `$INSTANCE_NAME`_TST_INTERNAL_CAP_EN            (`$SelfTestIntCapEnable`Lu)
#define `$INSTANCE_NAME`_TST_VDDA_EN                    (`$SelfTestVddaEnable`Lu)
`$SelfTestMaskDefines`
`$SelfTestDefines`
#endif /* CY_CAPSENSE_`$INSTANCE_NAME`_CONFIGURATION_H */


/* [] END OF FILE */
